In [22]:
# Code from https://www.youtube.com/watch?v=9YbTeY-IP4c&list=PLxgDUj5eygKnSd4MYHIuAC7E3VEPm_WLO&index=19
import pandas as pd

In [23]:
# !wget https://raw.githubusercontent.com/lazyprogrammer/machine_learning_examples/master/tf2.0/sbux.csv

In [24]:
df = pd.read_csv('https://raw.githubusercontent.com/lazyprogrammer/machine_learning_examples/master/tf2.0/sbux.csv')

In [25]:
type(df)

pandas.core.frame.DataFrame

In [26]:
df.head()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>date</th>
      <th>open</th>
      <th>high</th>
      <th>low</th>
      <th>close</th>
      <th>volume</th>
      <th>Name</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td>0</td>
      <td>2013-02-08</td>
      <td>27.920</td>
      <td>28.325</td>
      <td>27.920</td>
      <td>28.185</td>
      <td>7146296</td>
      <td>SBUX</td>
    </tr>
    <tr>
      <td>1</td>
      <td>2013-02-11</td>
      <td>28.260</td>
      <td>28.260</td>
      <td>27.930</td>
      <td>28.070</td>
      <td>5457354</td>
      <td>SBUX</td>
    </tr>
    <tr>
      <td>2</td>
      <td>2013-02-12</td>
      <td>28.000</td>
      <td>28.275</td>
      <td>27.975</td>
      <td>28.130</td>
      <td>8665592</td>
      <td>SBUX</td>
    </tr>
    <tr>
      <td>3</td>
      <td>2013-02-13</td>
      <td>28.230</td>
      <td>28.230</td>
      <td>27.750</td>
      <td>27.915</td>
      <td>7022056</td>
      <td>SBUX</td>
    </tr>
    <tr>
      <td>4</td>
      <td>2013-02-14</td>
      <td>27.765</td>
      <td>27.905</td>
      <td>27.675</td>
      <td>27.775</td>
      <td>8899188</td>
      <td>SBUX</td>
    </tr>
  </tbody>
</table>
</div>

In [27]:
df.head(10)

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>date</th>
      <th>open</th>
      <th>high</th>
      <th>low</th>
      <th>close</th>
      <th>volume</th>
      <th>Name</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td>0</td>
      <td>2013-02-08</td>
      <td>27.920</td>
      <td>28.325</td>
      <td>27.920</td>
      <td>28.185</td>
      <td>7146296</td>
      <td>SBUX</td>
    </tr>
    <tr>
      <td>1</td>
      <td>2013-02-11</td>
      <td>28.260</td>
      <td>28.260</td>
      <td>27.930</td>
      <td>28.070</td>
      <td>5457354</td>
      <td>SBUX</td>
    </tr>
    <tr>
      <td>2</td>
      <td>2013-02-12</td>
      <td>28.000</td>
      <td>28.275</td>
      <td>27.975</td>
      <td>28.130</td>
      <td>8665592</td>
      <td>SBUX</td>
    </tr>
    <tr>
      <td>3</td>
      <td>2013-02-13</td>
      <td>28.230</td>
      <td>28.230</td>
      <td>27.750</td>
      <td>27.915</td>
      <td>7022056</td>
      <td>SBUX</td>
    </tr>
    <tr>
      <td>4</td>
      <td>2013-02-14</td>
      <td>27.765</td>
      <td>27.905</td>
      <td>27.675</td>
      <td>27.775</td>
      <td>8899188</td>
      <td>SBUX</td>
    </tr>
    <tr>
      <td>5</td>
      <td>2013-02-15</td>
      <td>27.805</td>
      <td>27.850</td>
      <td>27.085</td>
      <td>27.170</td>
      <td>18195730</td>
      <td>SBUX</td>
    </tr>
    <tr>
      <td>6</td>
      <td>2013-02-19</td>
      <td>27.180</td>
      <td>27.305</td>
      <td>27.010</td>
      <td>27.225</td>
      <td>11760912</td>
      <td>SBUX</td>
    </tr>
    <tr>
      <td>7</td>
      <td>2013-02-20</td>
      <td>27.300</td>
      <td>27.420</td>
      <td>26.590</td>
      <td>26.655</td>
      <td>12472506</td>
      <td>SBUX</td>
    </tr>
    <tr>
      <td>8</td>
      <td>2013-02-21</td>
      <td>26.535</td>
      <td>26.820</td>
      <td>26.260</td>
      <td>26.675</td>
      <td>13896450</td>
      <td>SBUX</td>
    </tr>
    <tr>
      <td>9</td>
      <td>2013-02-22</td>
      <td>26.850</td>
      <td>27.105</td>
      <td>26.640</td>
      <td>27.085</td>
      <td>11487316</td>
      <td>SBUX</td>
    </tr>
  </tbody>
</table>
</div>

In [28]:
df.size

8813

In [29]:
df.tail()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>date</th>
      <th>open</th>
      <th>high</th>
      <th>low</th>
      <th>close</th>
      <th>volume</th>
      <th>Name</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td>1254</td>
      <td>2018-02-01</td>
      <td>56.280</td>
      <td>56.42</td>
      <td>55.89</td>
      <td>56.00</td>
      <td>14690146</td>
      <td>SBUX</td>
    </tr>
    <tr>
      <td>1255</td>
      <td>2018-02-02</td>
      <td>55.900</td>
      <td>56.32</td>
      <td>55.70</td>
      <td>55.77</td>
      <td>15358909</td>
      <td>SBUX</td>
    </tr>
    <tr>
      <td>1256</td>
      <td>2018-02-05</td>
      <td>55.530</td>
      <td>56.26</td>
      <td>54.57</td>
      <td>54.69</td>
      <td>16059955</td>
      <td>SBUX</td>
    </tr>
    <tr>
      <td>1257</td>
      <td>2018-02-06</td>
      <td>53.685</td>
      <td>56.06</td>
      <td>53.56</td>
      <td>55.61</td>
      <td>17415065</td>
      <td>SBUX</td>
    </tr>
    <tr>
      <td>1258</td>
      <td>2018-02-07</td>
      <td>55.080</td>
      <td>55.43</td>
      <td>54.44</td>
      <td>54.46</td>
      <td>13927022</td>
      <td>SBUX</td>
    </tr>
  </tbody>
</table>
</div>

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1259 entries, 0 to 1258
Data columns (total 7 columns):
date      1259 non-null object
open      1259 non-null float64
high      1259 non-null float64
low       1259 non-null float64
close     1259 non-null float64
volume    1259 non-null int64
Name      1259 non-null object
dtypes: float64(4), int64(1), object(2)
memory usage: 69.0+ KB